MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz_mc7/thirdparty/pic32cz_mc7/component/usart.h
/* LIN mode */
#define US_CR_LIN_RSTRX_Pos                   _UINT32_(2)                                          /* (US_CR) Reset Receiver Position */
#define US_CR_LIN_RSTRX_Msk                   (_UINT32_(0x1) << US_CR_LIN_RSTRX_Pos)               /* (US_CR) Reset Receiver Mask */
#define US_CR_LIN_RSTRX(value)                (US_CR_LIN_RSTRX_Msk & (_UINT32_(value) << US_CR_LIN_RSTRX_Pos))
#define US_CR_LIN_RSTTX_Pos                   _UINT32_(3)                                          /* (US_CR) Reset Transmitter Position */
#define US_CR_LIN_RSTTX_Msk                   (_UINT32_(0x1) << US_CR_LIN_RSTTX_Pos)               /* (US_CR) Reset Transmitter Mask */
#define US_CR_LIN_RSTTX(value)                (US_CR_LIN_RSTTX_Msk & (_UINT32_(value) << US_CR_LIN_RSTTX_Pos))
#define US_CR_LIN_RXEN_Pos                    _UINT32_(4)                                          /* (US_CR) Receiver Enable Position */
#define US_CR_LIN_RXEN_Msk                    (_UINT32_(0x1) << US_CR_LIN_RXEN_Pos)                /* (US_CR) Receiver Enable Mask */
#define US_CR_LIN_RXEN(value)                 (US_CR_LIN_RXEN_Msk & (_UINT32_(value) << US_CR_LIN_RXEN_Pos))
#define US_CR_LIN_RXDIS_Pos                   _UINT32_(5)                                          /* (US_CR) Receiver Disable Position */
#define US_CR_LIN_RXDIS_Msk                   (_UINT32_(0x1) << US_CR_LIN_RXDIS_Pos)               /* (US_CR) Receiver Disable Mask */
#define US_CR_LIN_RXDIS(value)                (US_CR_LIN_RXDIS_Msk & (_UINT32_(value) << US_CR_LIN_RXDIS_Pos))
#define US_CR_LIN_TXEN_Pos                    _UINT32_(6)                                          /* (US_CR) Transmitter Enable Position */
#define US_CR_LIN_TXEN_Msk                    (_UINT32_(0x1) << US_CR_LIN_TXEN_Pos)                /* (US_CR) Transmitter Enable Mask */
#define US_CR_LIN_TXEN(value)                 (US_CR_LIN_TXEN_Msk & (_UINT32_(value) << US_CR_LIN_TXEN_Pos))
#define US_CR_LIN_TXDIS_Pos                   _UINT32_(7)                                          /* (US_CR) Transmitter Disable Position */
#define US_CR_LIN_TXDIS_Msk                   (_UINT32_(0x1) << US_CR_LIN_TXDIS_Pos)               /* (US_CR) Transmitter Disable Mask */
#define US_CR_LIN_TXDIS(value)                (US_CR_LIN_TXDIS_Msk & (_UINT32_(value) << US_CR_LIN_TXDIS_Pos))
#define US_CR_LIN_RSTSTA_Pos                  _UINT32_(8)                                          /* (US_CR) Reset Status Bits Position */
#define US_CR_LIN_RSTSTA_Msk                  (_UINT32_(0x1) << US_CR_LIN_RSTSTA_Pos)              /* (US_CR) Reset Status Bits Mask */
#define US_CR_LIN_RSTSTA(value)               (US_CR_LIN_RSTSTA_Msk & (_UINT32_(value) << US_CR_LIN_RSTSTA_Pos))
#define US_CR_LIN_LINABT_Pos                  _UINT32_(20)                                         /* (US_CR) Abort LIN Transmission Position */
#define US_CR_LIN_LINABT_Msk                  (_UINT32_(0x1) << US_CR_LIN_LINABT_Pos)              /* (US_CR) Abort LIN Transmission Mask */
#define US_CR_LIN_LINABT(value)               (US_CR_LIN_LINABT_Msk & (_UINT32_(value) << US_CR_LIN_LINABT_Pos))
#define US_CR_LIN_LINWKUP_Pos                 _UINT32_(21)                                         /* (US_CR) Send LIN Wakeup Signal Position */
#define US_CR_LIN_LINWKUP_Msk                 (_UINT32_(0x1) << US_CR_LIN_LINWKUP_Pos)             /* (US_CR) Send LIN Wakeup Signal Mask */
#define US_CR_LIN_LINWKUP(value)              (US_CR_LIN_LINWKUP_Msk & (_UINT32_(value) << US_CR_LIN_LINWKUP_Pos))
#define US_CR_LIN_Msk                         _UINT32_(0x003001FC)                                 /* (US_CR_LIN) Register Mask  */


/* -------- US_MR : (USART Offset: 0x04) (R/W 32) Mode Register -------- */
#define US_MR_Msk                             _UINT32_(0x00000000)                                 /* (US_MR) Register Mask  */

/* USART mode */
#define US_MR_USART_MODE_Pos                  _UINT32_(0)                                          /* (US_MR) USART Mode of Operation Position */
#define US_MR_USART_MODE_Msk                  (_UINT32_(0xF) << US_MR_USART_MODE_Pos)              /* (US_MR) USART Mode of Operation Mask */
#define US_MR_USART_MODE(value)               (US_MR_USART_MODE_Msk & (_UINT32_(value) << US_MR_USART_MODE_Pos))
#define   US_MR_USART_MODE_NORMAL_Val         _UINT32_(0x0)                                        /* (US_MR) Normal mode  */
#define   US_MR_USART_MODE_RS485_Val          _UINT32_(0x1)                                        /* (US_MR) RS485  */
#define   US_MR_USART_MODE_HW_HANDSHAKING_Val _UINT32_(0x2)                                        /* (US_MR) Hardware handshaking  */
#define   US_MR_USART_MODE_MODEM_Val          _UINT32_(0x3)                                        /* (US_MR) Modem  */
#define   US_MR_USART_MODE_IS07816_T_0_Val    _UINT32_(0x4)                                        /* (US_MR) IS07816 Protocol: T = 0  */
#define   US_MR_USART_MODE_IS07816_T_1_Val    _UINT32_(0x6)                                        /* (US_MR) IS07816 Protocol: T = 1  */
#define   US_MR_USART_MODE_IRDA_Val           _UINT32_(0x8)                                        /* (US_MR) IrDA  */
#define   US_MR_USART_MODE_LON_Val            _UINT32_(0x9)                                        /* (US_MR) LON  */
#define   US_MR_USART_MODE_LIN_MASTER_Val     _UINT32_(0xA)                                        /* (US_MR) LIN Master mode  */
#define   US_MR_USART_MODE_LIN_SLAVE_Val      _UINT32_(0xB)                                        /* (US_MR) LIN Slave mode  */
#define   US_MR_USART_MODE_SPI_MASTER_Val     _UINT32_(0xE)                                        /* (US_MR) SPI Master mode (CLKO must be written to 1 and USCLKS = 0, 1 or 2)  */
#define   US_MR_USART_MODE_SPI_SLAVE_Val      _UINT32_(0xF)                                        /* (US_MR) SPI Slave mode  */
#define US_MR_USART_MODE_NORMAL               (US_MR_USART_MODE_NORMAL_Val << US_MR_USART_MODE_Pos) /* (US_MR) Normal mode Position */
#define US_MR_USART_MODE_RS485                (US_MR_USART_MODE_RS485_Val << US_MR_USART_MODE_Pos) /* (US_MR) RS485 Position */
#define US_MR_USART_MODE_HW_HANDSHAKING       (US_MR_USART_MODE_HW_HANDSHAKING_Val << US_MR_USART_MODE_Pos) /* (US_MR) Hardware handshaking Position */
#define US_MR_USART_MODE_MODEM                (US_MR_USART_MODE_MODEM_Val << US_MR_USART_MODE_Pos) /* (US_MR) Modem Position */
#define US_MR_USART_MODE_IS07816_T_0          (US_MR_USART_MODE_IS07816_T_0_Val << US_MR_USART_MODE_Pos) /* (US_MR) IS07816 Protocol: T = 0 Position */
#define US_MR_USART_MODE_IS07816_T_1          (US_MR_USART_MODE_IS07816_T_1_Val << US_MR_USART_MODE_Pos) /* (US_MR) IS07816 Protocol: T = 1 Position */
#define US_MR_USART_MODE_IRDA                 (US_MR_USART_MODE_IRDA_Val << US_MR_USART_MODE_Pos)  /* (US_MR) IrDA Position */
#define US_MR_USART_MODE_LON                  (US_MR_USART_MODE_LON_Val << US_MR_USART_MODE_Pos)   /* (US_MR) LON Position */
#define US_MR_USART_MODE_LIN_MASTER           (US_MR_USART_MODE_LIN_MASTER_Val << US_MR_USART_MODE_Pos) /* (US_MR) LIN Master mode Position */
#define US_MR_USART_MODE_LIN_SLAVE            (US_MR_USART_MODE_LIN_SLAVE_Val << US_MR_USART_MODE_Pos) /* (US_MR) LIN Slave mode Position */
#define US_MR_USART_MODE_SPI_MASTER           (US_MR_USART_MODE_SPI_MASTER_Val << US_MR_USART_MODE_Pos) /* (US_MR) SPI Master mode (CLKO must be written to 1 and USCLKS = 0, 1 or 2) Position */
#define US_MR_USART_MODE_SPI_SLAVE            (US_MR_USART_MODE_SPI_SLAVE_Val << US_MR_USART_MODE_Pos) /* (US_MR) SPI Slave mode Position */
#define US_MR_USART_USCLKS_Pos                _UINT32_(4)                                          /* (US_MR) Clock Selection Position */
#define US_MR_USART_USCLKS_Msk                (_UINT32_(0x3) << US_MR_USART_USCLKS_Pos)            /* (US_MR) Clock Selection Mask */
#define US_MR_USART_USCLKS(value)             (US_MR_USART_USCLKS_Msk & (_UINT32_(value) << US_MR_USART_USCLKS_Pos))
#define   US_MR_USART_USCLKS_MCK_Val          _UINT32_(0x0)                                        /* (US_MR) Peripheral clock is selected  */
#define   US_MR_USART_USCLKS_DIV_Val          _UINT32_(0x1)                                        /* (US_MR) Peripheral clock divided (DIV = 8) is selected  */
#define   US_MR_USART_USCLKS_PCK_Val          _UINT32_(0x2)                                        /* (US_MR) PMC programmable clock (PCK) is selected. If the SCK pin is driven (CLKO = 1), the CD field must be greater than 1.  */
#define   US_MR_USART_USCLKS_SCK_Val          _UINT32_(0x3)                                        /* (US_MR) Serial clock (SCK) is selected  */
#define US_MR_USART_USCLKS_MCK                (US_MR_USART_USCLKS_MCK_Val << US_MR_USART_USCLKS_Pos) /* (US_MR) Peripheral clock is selected Position */
#define US_MR_USART_USCLKS_DIV                (US_MR_USART_USCLKS_DIV_Val << US_MR_USART_USCLKS_Pos) /* (US_MR) Peripheral clock divided (DIV = 8) is selected Position */
#define US_MR_USART_USCLKS_PCK                (US_MR_USART_USCLKS_PCK_Val << US_MR_USART_USCLKS_Pos) /* (US_MR) PMC programmable clock (PCK) is selected. If the SCK pin is driven (CLKO = 1), the CD field must be greater than 1. Position */
#define US_MR_USART_USCLKS_SCK                (US_MR_USART_USCLKS_SCK_Val << US_MR_USART_USCLKS_Pos) /* (US_MR) Serial clock (SCK) is selected Position */
#define US_MR_USART_CHRL_Pos                  _UINT32_(6)                                          /* (US_MR) Character Length Position */
#define US_MR_USART_CHRL_Msk                  (_UINT32_(0x3) << US_MR_USART_CHRL_Pos)              /* (US_MR) Character Length Mask */
#define US_MR_USART_CHRL(value)               (US_MR_USART_CHRL_Msk & (_UINT32_(value) << US_MR_USART_CHRL_Pos))
#define   US_MR_USART_CHRL_5_BIT_Val          _UINT32_(0x0)                                        /* (US_MR) Character length is 5 bits  */
#define   US_MR_USART_CHRL_6_BIT_Val          _UINT32_(0x1)                                        /* (US_MR) Character length is 6 bits  */
#define   US_MR_USART_CHRL_7_BIT_Val          _UINT32_(0x2)                                        /* (US_MR) Character length is 7 bits  */
#define   US_MR_USART_CHRL_8_BIT_Val          _UINT32_(0x3)                                        /* (US_MR) Character length is 8 bits  */
#define US_MR_USART_CHRL_5_BIT                (US_MR_USART_CHRL_5_BIT_Val << US_MR_USART_CHRL_Pos) /* (US_MR) Character length is 5 bits Position */
#define US_MR_USART_CHRL_6_BIT                (US_MR_USART_CHRL_6_BIT_Val << US_MR_USART_CHRL_Pos) /* (US_MR) Character length is 6 bits Position */
#define US_MR_USART_CHRL_7_BIT                (US_MR_USART_CHRL_7_BIT_Val << US_MR_USART_CHRL_Pos) /* (US_MR) Character length is 7 bits Position */
#define US_MR_USART_CHRL_8_BIT                (US_MR_USART_CHRL_8_BIT_Val << US_MR_USART_CHRL_Pos) /* (US_MR) Character length is 8 bits Position */
#define US_MR_USART_SYNC_Pos                  _UINT32_(8)                                          /* (US_MR) Synchronous Mode Select Position */
#define US_MR_USART_SYNC_Msk                  (_UINT32_(0x1) << US_MR_USART_SYNC_Pos)              /* (US_MR) Synchronous Mode Select Mask */
#define US_MR_USART_SYNC(value)               (US_MR_USART_SYNC_Msk & (_UINT32_(value) << US_MR_USART_SYNC_Pos))
#define US_MR_USART_PAR_Pos                   _UINT32_(9)                                          /* (US_MR) Parity Type Position */
#define US_MR_USART_PAR_Msk                   (_UINT32_(0x7) << US_MR_USART_PAR_Pos)               /* (US_MR) Parity Type Mask */
#define US_MR_USART_PAR(value)                (US_MR_USART_PAR_Msk & (_UINT32_(value) << US_MR_USART_PAR_Pos))
#define   US_MR_USART_PAR_EVEN_Val            _UINT32_(0x0)                                        /* (US_MR) Even parity  */
#define   US_MR_USART_PAR_ODD_Val             _UINT32_(0x1)                                        /* (US_MR) Odd parity  */
#define   US_MR_USART_PAR_SPACE_Val           _UINT32_(0x2)                                        /* (US_MR) Parity forced to 0 (Space)  */
#define   US_MR_USART_PAR_MARK_Val            _UINT32_(0x3)                                        /* (US_MR) Parity forced to 1 (Mark)  */
#define   US_MR_USART_PAR_NO_Val              _UINT32_(0x4)                                        /* (US_MR) No parity  */
#define   US_MR_USART_PAR_MULTIDROP_Val       _UINT32_(0x6)                                        /* (US_MR) Multidrop mode  */
#define US_MR_USART_PAR_EVEN                  (US_MR_USART_PAR_EVEN_Val << US_MR_USART_PAR_Pos)    /* (US_MR) Even parity Position */
#define US_MR_USART_PAR_ODD                   (US_MR_USART_PAR_ODD_Val << US_MR_USART_PAR_Pos)     /* (US_MR) Odd parity Position */
#define US_MR_USART_PAR_SPACE                 (US_MR_USART_PAR_SPACE_Val << US_MR_USART_PAR_Pos)   /* (US_MR) Parity forced to 0 (Space) Position */
#define US_MR_USART_PAR_MARK                  (US_MR_USART_PAR_MARK_Val << US_MR_USART_PAR_Pos)    /* (US_MR) Parity forced to 1 (Mark) Position */
#define US_MR_USART_PAR_NO                    (US_MR_USART_PAR_NO_Val << US_MR_USART_PAR_Pos)      /* (US_MR) No parity Position */
#define US_MR_USART_PAR_MULTIDROP             (US_MR_USART_PAR_MULTIDROP_Val << US_MR_USART_PAR_Pos) /* (US_MR) Multidrop mode Position */
#define US_MR_USART_NBSTOP_Pos                _UINT32_(12)                                         /* (US_MR) Number of Stop Bits Position */
#define US_MR_USART_NBSTOP_Msk                (_UINT32_(0x3) << US_MR_USART_NBSTOP_Pos)            /* (US_MR) Number of Stop Bits Mask */
#define US_MR_USART_NBSTOP(value)             (US_MR_USART_NBSTOP_Msk & (_UINT32_(value) << US_MR_USART_NBSTOP_Pos))
#define   US_MR_USART_NBSTOP_1_BIT_Val        _UINT32_(0x0)                                        /* (US_MR) 1 stop bit  */
#define   US_MR_USART_NBSTOP_1_5_BIT_Val      _UINT32_(0x1)                                        /* (US_MR) 1.5 stop bit (SYNC = 0) or reserved (SYNC = 1)  */
#define   US_MR_USART_NBSTOP_2_BIT_Val        _UINT32_(0x2)                                        /* (US_MR) 2 stop bits  */
#define US_MR_USART_NBSTOP_1_BIT              (US_MR_USART_NBSTOP_1_BIT_Val << US_MR_USART_NBSTOP_Pos) /* (US_MR) 1 stop bit Position */
#define US_MR_USART_NBSTOP_1_5_BIT            (US_MR_USART_NBSTOP_1_5_BIT_Val << US_MR_USART_NBSTOP_Pos) /* (US_MR) 1.5 stop bit (SYNC = 0) or reserved (SYNC = 1) Position */
#define US_MR_USART_NBSTOP_2_BIT              (US_MR_USART_NBSTOP_2_BIT_Val << US_MR_USART_NBSTOP_Pos) /* (US_MR) 2 stop bits Position */
#define US_MR_USART_CHMODE_Pos                _UINT32_(14)                                         /* (US_MR) Channel Mode Position */
#define US_MR_USART_CHMODE_Msk                (_UINT32_(0x3) << US_MR_USART_CHMODE_Pos)            /* (US_MR) Channel Mode Mask */
#define US_MR_USART_CHMODE(value)             (US_MR_USART_CHMODE_Msk & (_UINT32_(value) << US_MR_USART_CHMODE_Pos))
#define   US_MR_USART_CHMODE_NORMAL_Val       _UINT32_(0x0)                                        /* (US_MR) Normal mode  */
#define   US_MR_USART_CHMODE_AUTOMATIC_Val    _UINT32_(0x1)                                        /* (US_MR) Automatic Echo. Receiver input is connected to the TXD pin.  */
#define   US_MR_USART_CHMODE_LOCAL_LOOPBACK_Val _UINT32_(0x2)                                        /* (US_MR) Local Loopback. Transmitter output is connected to the Receiver Input.  */
#define   US_MR_USART_CHMODE_REMOTE_LOOPBACK_Val _UINT32_(0x3)                                        /* (US_MR) Remote Loopback. RXD pin is internally connected to the TXD pin.  */
#define US_MR_USART_CHMODE_NORMAL             (US_MR_USART_CHMODE_NORMAL_Val << US_MR_USART_CHMODE_Pos) /* (US_MR) Normal mode Position */
#define US_MR_USART_CHMODE_AUTOMATIC          (US_MR_USART_CHMODE_AUTOMATIC_Val << US_MR_USART_CHMODE_Pos) /* (US_MR) Automatic Echo. Receiver input is connected to the TXD pin. Position */
#define US_MR_USART_CHMODE_LOCAL_LOOPBACK     (US_MR_USART_CHMODE_LOCAL_LOOPBACK_Val << US_MR_USART_CHMODE_Pos) /* (US_MR) Local Loopback. Transmitter output is connected to the Receiver Input. Position */
#define US_MR_USART_CHMODE_REMOTE_LOOPBACK    (US_MR_USART_CHMODE_REMOTE_LOOPBACK_Val << US_MR_USART_CHMODE_Pos) /* (US_MR) Remote Loopback. RXD pin is internally connected to the TXD pin. Position */
#define US_MR_USART_MSBF_Pos                  _UINT32_(16)                                         /* (US_MR) Bit Order Position */
#define US_MR_USART_MSBF_Msk                  (_UINT32_(0x1) << US_MR_USART_MSBF_Pos)              /* (US_MR) Bit Order Mask */
#define US_MR_USART_MSBF(value)               (US_MR_USART_MSBF_Msk & (_UINT32_(value) << US_MR_USART_MSBF_Pos))
#define US_MR_USART_MODE9_Pos                 _UINT32_(17)                                         /* (US_MR) 9-bit Character Length Position */
#define US_MR_USART_MODE9_Msk                 (_UINT32_(0x1) << US_MR_USART_MODE9_Pos)             /* (US_MR) 9-bit Character Length Mask */
#define US_MR_USART_MODE9(value)              (US_MR_USART_MODE9_Msk & (_UINT32_(value) << US_MR_USART_MODE9_Pos))
#define US_MR_USART_CLKO_Pos                  _UINT32_(18)                                         /* (US_MR) Clock Output Select Position */
#define US_MR_USART_CLKO_Msk                  (_UINT32_(0x1) << US_MR_USART_CLKO_Pos)              /* (US_MR) Clock Output Select Mask */
#define US_MR_USART_CLKO(value)               (US_MR_USART_CLKO_Msk & (_UINT32_(value) << US_MR_USART_CLKO_Pos))
#define US_MR_USART_OVER_Pos                  _UINT32_(19)                                         /* (US_MR) Oversampling Mode Position */
#define US_MR_USART_OVER_Msk                  (_UINT32_(0x1) << US_MR_USART_OVER_Pos)              /* (US_MR) Oversampling Mode Mask */
#define US_MR_USART_OVER(value)               (US_MR_USART_OVER_Msk & (_UINT32_(value) << US_MR_USART_OVER_Pos))
#define US_MR_USART_INACK_Pos                 _UINT32_(20)                                         /* (US_MR) Inhibit Non Acknowledge Position */
#define US_MR_USART_INACK_Msk                 (_UINT32_(0x1) << US_MR_USART_INACK_Pos)             /* (US_MR) Inhibit Non Acknowledge Mask */
#define US_MR_USART_INACK(value)              (US_MR_USART_INACK_Msk & (_UINT32_(value) << US_MR_USART_INACK_Pos))
#define US_MR_USART_DSNACK_Pos                _UINT32_(21)                                         /* (US_MR) Disable Successive NACK Position */
#define US_MR_USART_DSNACK_Msk                (_UINT32_(0x1) << US_MR_USART_DSNACK_Pos)            /* (US_MR) Disable Successive NACK Mask */
#define US_MR_USART_DSNACK(value)             (US_MR_USART_DSNACK_Msk & (_UINT32_(value) << US_MR_USART_DSNACK_Pos))
#define US_MR_USART_VAR_SYNC_Pos              _UINT32_(22)                                         /* (US_MR) Variable Synchronization of Command/Data Sync Start Frame Delimiter Position */
#define US_MR_USART_VAR_SYNC_Msk              (_UINT32_(0x1) << US_MR_USART_VAR_SYNC_Pos)          /* (US_MR) Variable Synchronization of Command/Data Sync Start Frame Delimiter Mask */
#define US_MR_USART_VAR_SYNC(value)           (US_MR_USART_VAR_SYNC_Msk & (_UINT32_(value) << US_MR_USART_VAR_SYNC_Pos))
#define US_MR_USART_INVDATA_Pos               _UINT32_(23)                                         /* (US_MR) Inverted Data Position */
#define US_MR_USART_INVDATA_Msk               (_UINT32_(0x1) << US_MR_USART_INVDATA_Pos)           /* (US_MR) Inverted Data Mask */
#define US_MR_USART_INVDATA(value)            (US_MR_USART_INVDATA_Msk & (_UINT32_(value) << US_MR_USART_INVDATA_Pos))
#define US_MR_USART_MAX_ITERATION_Pos         _UINT32_(24)                                         /* (US_MR) Maximum Number of Automatic Iteration Position */
#define US_MR_USART_MAX_ITERATION_Msk         (_UINT32_(0x7) << US_MR_USART_MAX_ITERATION_Pos)     /* (US_MR) Maximum Number of Automatic Iteration Mask */
#define US_MR_USART_MAX_ITERATION(value)      (US_MR_USART_MAX_ITERATION_Msk & (_UINT32_(value) << US_MR_USART_MAX_ITERATION_Pos))
#define US_MR_USART_FILTER_Pos                _UINT32_(28)                                         /* (US_MR) Receive Line Filter Position */
#define US_MR_USART_FILTER_Msk                (_UINT32_(0x1) << US_MR_USART_FILTER_Pos)            /* (US_MR) Receive Line Filter Mask */
#define US_MR_USART_FILTER(value)             (US_MR_USART_FILTER_Msk & (_UINT32_(value) << US_MR_USART_FILTER_Pos))
#define US_MR_USART_MAN_Pos                   _UINT32_(29)                                         /* (US_MR) Manchester Encoder/Decoder Enable Position */
#define US_MR_USART_MAN_Msk                   (_UINT32_(0x1) << US_MR_USART_MAN_Pos)               /* (US_MR) Manchester Encoder/Decoder Enable Mask */
#define US_MR_USART_MAN(value)                (US_MR_USART_MAN_Msk & (_UINT32_(value) << US_MR_USART_MAN_Pos))
#define US_MR_USART_MODSYNC_Pos               _UINT32_(30)                                         /* (US_MR) Manchester Synchronization Mode Position */
#define US_MR_USART_MODSYNC_Msk               (_UINT32_(0x1) << US_MR_USART_MODSYNC_Pos)           /* (US_MR) Manchester Synchronization Mode Mask */
#define US_MR_USART_MODSYNC(value)            (US_MR_USART_MODSYNC_Msk & (_UINT32_(value) << US_MR_USART_MODSYNC_Pos))
#define US_MR_USART_ONEBIT_Pos                _UINT32_(31)                                         /* (US_MR) Start Frame Delimiter Selector Position */
#define US_MR_USART_ONEBIT_Msk                (_UINT32_(0x1) << US_MR_USART_ONEBIT_Pos)            /* (US_MR) Start Frame Delimiter Selector Mask */
#define US_MR_USART_ONEBIT(value)             (US_MR_USART_ONEBIT_Msk & (_UINT32_(value) << US_MR_USART_ONEBIT_Pos))
#define US_MR_USART_Msk                       _UINT32_(0xF7FFFFFF)                                 /* (US_MR_USART) Register Mask  */

