MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz_mc7/thirdparty/pic32cz_mc7/component/usart.h
/* -------- US_IER : (USART Offset: 0x08) ( /W 32) Interrupt Enable Register -------- */
#define US_IER_Msk                            _UINT32_(0x00000000)                                 /* (US_IER) Register Mask  */

/* USART mode */
#define US_IER_USART_RXRDY_Pos                _UINT32_(0)                                          /* (US_IER) RXRDY Interrupt Enable Position */
#define US_IER_USART_RXRDY_Msk                (_UINT32_(0x1) << US_IER_USART_RXRDY_Pos)            /* (US_IER) RXRDY Interrupt Enable Mask */
#define US_IER_USART_RXRDY(value)             (US_IER_USART_RXRDY_Msk & (_UINT32_(value) << US_IER_USART_RXRDY_Pos))
#define US_IER_USART_TXRDY_Pos                _UINT32_(1)                                          /* (US_IER) TXRDY Interrupt Enable Position */
#define US_IER_USART_TXRDY_Msk                (_UINT32_(0x1) << US_IER_USART_TXRDY_Pos)            /* (US_IER) TXRDY Interrupt Enable Mask */
#define US_IER_USART_TXRDY(value)             (US_IER_USART_TXRDY_Msk & (_UINT32_(value) << US_IER_USART_TXRDY_Pos))
#define US_IER_USART_RXBRK_Pos                _UINT32_(2)                                          /* (US_IER) Receiver Break Interrupt Enable Position */
#define US_IER_USART_RXBRK_Msk                (_UINT32_(0x1) << US_IER_USART_RXBRK_Pos)            /* (US_IER) Receiver Break Interrupt Enable Mask */
#define US_IER_USART_RXBRK(value)             (US_IER_USART_RXBRK_Msk & (_UINT32_(value) << US_IER_USART_RXBRK_Pos))
#define US_IER_USART_OVRE_Pos                 _UINT32_(5)                                          /* (US_IER) Overrun Error Interrupt Enable Position */
#define US_IER_USART_OVRE_Msk                 (_UINT32_(0x1) << US_IER_USART_OVRE_Pos)             /* (US_IER) Overrun Error Interrupt Enable Mask */
#define US_IER_USART_OVRE(value)              (US_IER_USART_OVRE_Msk & (_UINT32_(value) << US_IER_USART_OVRE_Pos))
#define US_IER_USART_FRAME_Pos                _UINT32_(6)                                          /* (US_IER) Framing Error Interrupt Enable Position */
#define US_IER_USART_FRAME_Msk                (_UINT32_(0x1) << US_IER_USART_FRAME_Pos)            /* (US_IER) Framing Error Interrupt Enable Mask */
#define US_IER_USART_FRAME(value)             (US_IER_USART_FRAME_Msk & (_UINT32_(value) << US_IER_USART_FRAME_Pos))
#define US_IER_USART_PARE_Pos                 _UINT32_(7)                                          /* (US_IER) Parity Error Interrupt Enable Position */
#define US_IER_USART_PARE_Msk                 (_UINT32_(0x1) << US_IER_USART_PARE_Pos)             /* (US_IER) Parity Error Interrupt Enable Mask */
#define US_IER_USART_PARE(value)              (US_IER_USART_PARE_Msk & (_UINT32_(value) << US_IER_USART_PARE_Pos))
#define US_IER_USART_TIMEOUT_Pos              _UINT32_(8)                                          /* (US_IER) Timeout Interrupt Enable Position */
#define US_IER_USART_TIMEOUT_Msk              (_UINT32_(0x1) << US_IER_USART_TIMEOUT_Pos)          /* (US_IER) Timeout Interrupt Enable Mask */
#define US_IER_USART_TIMEOUT(value)           (US_IER_USART_TIMEOUT_Msk & (_UINT32_(value) << US_IER_USART_TIMEOUT_Pos))
#define US_IER_USART_TXEMPTY_Pos              _UINT32_(9)                                          /* (US_IER) TXEMPTY Interrupt Enable Position */
#define US_IER_USART_TXEMPTY_Msk              (_UINT32_(0x1) << US_IER_USART_TXEMPTY_Pos)          /* (US_IER) TXEMPTY Interrupt Enable Mask */
#define US_IER_USART_TXEMPTY(value)           (US_IER_USART_TXEMPTY_Msk & (_UINT32_(value) << US_IER_USART_TXEMPTY_Pos))
#define US_IER_USART_ITER_Pos                 _UINT32_(10)                                         /* (US_IER) Max number of Repetitions Reached Interrupt Enable Position */
#define US_IER_USART_ITER_Msk                 (_UINT32_(0x1) << US_IER_USART_ITER_Pos)             /* (US_IER) Max number of Repetitions Reached Interrupt Enable Mask */
#define US_IER_USART_ITER(value)              (US_IER_USART_ITER_Msk & (_UINT32_(value) << US_IER_USART_ITER_Pos))
#define US_IER_USART_NACK_Pos                 _UINT32_(13)                                         /* (US_IER) Non Acknowledge Interrupt Enable Position */
#define US_IER_USART_NACK_Msk                 (_UINT32_(0x1) << US_IER_USART_NACK_Pos)             /* (US_IER) Non Acknowledge Interrupt Enable Mask */
#define US_IER_USART_NACK(value)              (US_IER_USART_NACK_Msk & (_UINT32_(value) << US_IER_USART_NACK_Pos))
#define US_IER_USART_RIIC_Pos                 _UINT32_(16)                                         /* (US_IER) Ring Indicator Input Change Enable Position */
#define US_IER_USART_RIIC_Msk                 (_UINT32_(0x1) << US_IER_USART_RIIC_Pos)             /* (US_IER) Ring Indicator Input Change Enable Mask */
#define US_IER_USART_RIIC(value)              (US_IER_USART_RIIC_Msk & (_UINT32_(value) << US_IER_USART_RIIC_Pos))
#define US_IER_USART_DSRIC_Pos                _UINT32_(17)                                         /* (US_IER) Data Set Ready Input Change Enable Position */
#define US_IER_USART_DSRIC_Msk                (_UINT32_(0x1) << US_IER_USART_DSRIC_Pos)            /* (US_IER) Data Set Ready Input Change Enable Mask */
#define US_IER_USART_DSRIC(value)             (US_IER_USART_DSRIC_Msk & (_UINT32_(value) << US_IER_USART_DSRIC_Pos))
#define US_IER_USART_DCDIC_Pos                _UINT32_(18)                                         /* (US_IER) Data Carrier Detect Input Change Interrupt Enable Position */
#define US_IER_USART_DCDIC_Msk                (_UINT32_(0x1) << US_IER_USART_DCDIC_Pos)            /* (US_IER) Data Carrier Detect Input Change Interrupt Enable Mask */
#define US_IER_USART_DCDIC(value)             (US_IER_USART_DCDIC_Msk & (_UINT32_(value) << US_IER_USART_DCDIC_Pos))
#define US_IER_USART_CTSIC_Pos                _UINT32_(19)                                         /* (US_IER) Clear to Send Input Change Interrupt Enable Position */
#define US_IER_USART_CTSIC_Msk                (_UINT32_(0x1) << US_IER_USART_CTSIC_Pos)            /* (US_IER) Clear to Send Input Change Interrupt Enable Mask */
#define US_IER_USART_CTSIC(value)             (US_IER_USART_CTSIC_Msk & (_UINT32_(value) << US_IER_USART_CTSIC_Pos))
#define US_IER_USART_MANE_Pos                 _UINT32_(24)                                         /* (US_IER) Manchester Error Interrupt Enable Position */
#define US_IER_USART_MANE_Msk                 (_UINT32_(0x1) << US_IER_USART_MANE_Pos)             /* (US_IER) Manchester Error Interrupt Enable Mask */
#define US_IER_USART_MANE(value)              (US_IER_USART_MANE_Msk & (_UINT32_(value) << US_IER_USART_MANE_Pos))
#define US_IER_USART_Msk                      _UINT32_(0x010F27E7)                                 /* (US_IER_USART) Register Mask  */

/* SPI mode */
#define US_IER_SPI_RXRDY_Pos                  _UINT32_(0)                                          /* (US_IER) RXRDY Interrupt Enable Position */
#define US_IER_SPI_RXRDY_Msk                  (_UINT32_(0x1) << US_IER_SPI_RXRDY_Pos)              /* (US_IER) RXRDY Interrupt Enable Mask */
#define US_IER_SPI_RXRDY(value)               (US_IER_SPI_RXRDY_Msk & (_UINT32_(value) << US_IER_SPI_RXRDY_Pos))
#define US_IER_SPI_TXRDY_Pos                  _UINT32_(1)                                          /* (US_IER) TXRDY Interrupt Enable Position */
#define US_IER_SPI_TXRDY_Msk                  (_UINT32_(0x1) << US_IER_SPI_TXRDY_Pos)              /* (US_IER) TXRDY Interrupt Enable Mask */
#define US_IER_SPI_TXRDY(value)               (US_IER_SPI_TXRDY_Msk & (_UINT32_(value) << US_IER_SPI_TXRDY_Pos))
#define US_IER_SPI_OVRE_Pos                   _UINT32_(5)                                          /* (US_IER) Overrun Error Interrupt Enable Position */
#define US_IER_SPI_OVRE_Msk                   (_UINT32_(0x1) << US_IER_SPI_OVRE_Pos)               /* (US_IER) Overrun Error Interrupt Enable Mask */
#define US_IER_SPI_OVRE(value)                (US_IER_SPI_OVRE_Msk & (_UINT32_(value) << US_IER_SPI_OVRE_Pos))
#define US_IER_SPI_TXEMPTY_Pos                _UINT32_(9)                                          /* (US_IER) TXEMPTY Interrupt Enable Position */
#define US_IER_SPI_TXEMPTY_Msk                (_UINT32_(0x1) << US_IER_SPI_TXEMPTY_Pos)            /* (US_IER) TXEMPTY Interrupt Enable Mask */
#define US_IER_SPI_TXEMPTY(value)             (US_IER_SPI_TXEMPTY_Msk & (_UINT32_(value) << US_IER_SPI_TXEMPTY_Pos))
#define US_IER_SPI_UNRE_Pos                   _UINT32_(10)                                         /* (US_IER) Underrun Error Interrupt Enable Position */
#define US_IER_SPI_UNRE_Msk                   (_UINT32_(0x1) << US_IER_SPI_UNRE_Pos)               /* (US_IER) Underrun Error Interrupt Enable Mask */
#define US_IER_SPI_UNRE(value)                (US_IER_SPI_UNRE_Msk & (_UINT32_(value) << US_IER_SPI_UNRE_Pos))
#define US_IER_SPI_NSSE_Pos                   _UINT32_(19)                                         /* (US_IER) NSS Line (Driving CTS Pin) Rising or Falling Edge Event Position */
#define US_IER_SPI_NSSE_Msk                   (_UINT32_(0x1) << US_IER_SPI_NSSE_Pos)               /* (US_IER) NSS Line (Driving CTS Pin) Rising or Falling Edge Event Mask */
#define US_IER_SPI_NSSE(value)                (US_IER_SPI_NSSE_Msk & (_UINT32_(value) << US_IER_SPI_NSSE_Pos))
#define US_IER_SPI_Msk                        _UINT32_(0x00080623)                                 /* (US_IER_SPI) Register Mask  */

