MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz_mc7/thirdparty/pic32cz_mc7/component/usart.h
/* -------- US_RHR : (USART Offset: 0x18) ( R/ 32) Receive Holding Register -------- */
#define US_RHR_RXCHR_Pos                      _UINT32_(0)                                          /* (US_RHR) Received Character Position */
#define US_RHR_RXCHR_Msk                      (_UINT32_(0x1FF) << US_RHR_RXCHR_Pos)                /* (US_RHR) Received Character Mask */
#define US_RHR_RXCHR(value)                   (US_RHR_RXCHR_Msk & (_UINT32_(value) << US_RHR_RXCHR_Pos)) /* Assignment of value for RXCHR in the US_RHR register */
#define US_RHR_RXSYNH_Pos                     _UINT32_(15)                                         /* (US_RHR) Received Sync Position */
#define US_RHR_RXSYNH_Msk                     (_UINT32_(0x1) << US_RHR_RXSYNH_Pos)                 /* (US_RHR) Received Sync Mask */
#define US_RHR_RXSYNH(value)                  (US_RHR_RXSYNH_Msk & (_UINT32_(value) << US_RHR_RXSYNH_Pos)) /* Assignment of value for RXSYNH in the US_RHR register */
#define US_RHR_Msk                            _UINT32_(0x000081FF)                                 /* (US_RHR) Register Mask  */


/* -------- US_THR : (USART Offset: 0x1C) ( /W 32) Transmit Holding Register -------- */
#define US_THR_TXCHR_Pos                      _UINT32_(0)                                          /* (US_THR) Character to be Transmitted Position */
#define US_THR_TXCHR_Msk                      (_UINT32_(0x1FF) << US_THR_TXCHR_Pos)                /* (US_THR) Character to be Transmitted Mask */
#define US_THR_TXCHR(value)                   (US_THR_TXCHR_Msk & (_UINT32_(value) << US_THR_TXCHR_Pos)) /* Assignment of value for TXCHR in the US_THR register */
#define US_THR_TXSYNH_Pos                     _UINT32_(15)                                         /* (US_THR) Sync Field to be Transmitted Position */
#define US_THR_TXSYNH_Msk                     (_UINT32_(0x1) << US_THR_TXSYNH_Pos)                 /* (US_THR) Sync Field to be Transmitted Mask */
#define US_THR_TXSYNH(value)                  (US_THR_TXSYNH_Msk & (_UINT32_(value) << US_THR_TXSYNH_Pos)) /* Assignment of value for TXSYNH in the US_THR register */
#define US_THR_Msk                            _UINT32_(0x000081FF)                                 /* (US_THR) Register Mask  */


/* -------- US_BRGR : (USART Offset: 0x20) (R/W 32) Baud Rate Generator Register -------- */
#define US_BRGR_CD_Pos                        _UINT32_(0)                                          /* (US_BRGR) Clock Divider Position */
#define US_BRGR_CD_Msk                        (_UINT32_(0xFFFF) << US_BRGR_CD_Pos)                 /* (US_BRGR) Clock Divider Mask */
#define US_BRGR_CD(value)                     (US_BRGR_CD_Msk & (_UINT32_(value) << US_BRGR_CD_Pos)) /* Assignment of value for CD in the US_BRGR register */
#define US_BRGR_FP_Pos                        _UINT32_(16)                                         /* (US_BRGR) Fractional Part Position */
#define US_BRGR_FP_Msk                        (_UINT32_(0x7) << US_BRGR_FP_Pos)                    /* (US_BRGR) Fractional Part Mask */
#define US_BRGR_FP(value)                     (US_BRGR_FP_Msk & (_UINT32_(value) << US_BRGR_FP_Pos)) /* Assignment of value for FP in the US_BRGR register */
#define US_BRGR_Msk                           _UINT32_(0x0007FFFF)                                 /* (US_BRGR) Register Mask  */


/* -------- US_RTOR : (USART Offset: 0x24) (R/W 32) Receiver Timeout Register -------- */
#define US_RTOR_TO_Pos                        _UINT32_(0)                                          /* (US_RTOR) Timeout Value Position */
#define US_RTOR_TO_Msk                        (_UINT32_(0x1FFFF) << US_RTOR_TO_Pos)                /* (US_RTOR) Timeout Value Mask */
#define US_RTOR_TO(value)                     (US_RTOR_TO_Msk & (_UINT32_(value) << US_RTOR_TO_Pos)) /* Assignment of value for TO in the US_RTOR register */
#define US_RTOR_Msk                           _UINT32_(0x0001FFFF)                                 /* (US_RTOR) Register Mask  */


/* -------- US_TTGR : (USART Offset: 0x28) (R/W 32) Transmitter Timeguard Register -------- */
#define US_TTGR_Msk                           _UINT32_(0x00000000)                                 /* (US_TTGR) Register Mask  */

/* USART mode */
#define US_TTGR_USART_TG_Pos                  _UINT32_(0)                                          /* (US_TTGR) Timeguard Value Position */
#define US_TTGR_USART_TG_Msk                  (_UINT32_(0xFF) << US_TTGR_USART_TG_Pos)             /* (US_TTGR) Timeguard Value Mask */
#define US_TTGR_USART_TG(value)               (US_TTGR_USART_TG_Msk & (_UINT32_(value) << US_TTGR_USART_TG_Pos))
#define US_TTGR_USART_Msk                     _UINT32_(0x000000FF)                                 /* (US_TTGR_USART) Register Mask  */

/* LON mode */
#define US_TTGR_LON_PCYCLE_Pos                _UINT32_(0)                                          /* (US_TTGR) LON PCYCLE Length Position */
#define US_TTGR_LON_PCYCLE_Msk                (_UINT32_(0xFFFFFF) << US_TTGR_LON_PCYCLE_Pos)       /* (US_TTGR) LON PCYCLE Length Mask */
#define US_TTGR_LON_PCYCLE(value)             (US_TTGR_LON_PCYCLE_Msk & (_UINT32_(value) << US_TTGR_LON_PCYCLE_Pos))
#define US_TTGR_LON_Msk                       _UINT32_(0x00FFFFFF)                                 /* (US_TTGR_LON) Register Mask  */


/* -------- US_FIDI : (USART Offset: 0x40) (R/W 32) FI DI Ratio Register -------- */
#define US_FIDI_Msk                           _UINT32_(0x00000000)                                 /* (US_FIDI) Register Mask  */

/* USART mode */
#define US_FIDI_USART_FI_DI_RATIO_Pos         _UINT32_(0)                                          /* (US_FIDI) FI Over DI Ratio Value Position */
#define US_FIDI_USART_FI_DI_RATIO_Msk         (_UINT32_(0xFFFF) << US_FIDI_USART_FI_DI_RATIO_Pos)  /* (US_FIDI) FI Over DI Ratio Value Mask */
#define US_FIDI_USART_FI_DI_RATIO(value)      (US_FIDI_USART_FI_DI_RATIO_Msk & (_UINT32_(value) << US_FIDI_USART_FI_DI_RATIO_Pos))
#define US_FIDI_USART_Msk                     _UINT32_(0x0000FFFF)                                 /* (US_FIDI_USART) Register Mask  */

/* LON mode */
#define US_FIDI_LON_BETA2_Pos                 _UINT32_(0)                                          /* (US_FIDI) LON BETA2 Length Position */
#define US_FIDI_LON_BETA2_Msk                 (_UINT32_(0xFFFFFF) << US_FIDI_LON_BETA2_Pos)        /* (US_FIDI) LON BETA2 Length Mask */
#define US_FIDI_LON_BETA2(value)              (US_FIDI_LON_BETA2_Msk & (_UINT32_(value) << US_FIDI_LON_BETA2_Pos))
#define US_FIDI_LON_Msk                       _UINT32_(0x00FFFFFF)                                 /* (US_FIDI_LON) Register Mask  */


