MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz_mc7/thirdparty/pic32cz_mc7/component/usart.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* USART register API structure */
typedef struct
{
  __O   uint32_t                       US_CR;              /* Offset: 0x00 ( /W  32) Control Register */
  __IO  uint32_t                       US_MR;              /* Offset: 0x04 (R/W  32) Mode Register */
  __O   uint32_t                       US_IER;             /* Offset: 0x08 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       US_IDR;             /* Offset: 0x0C ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       US_IMR;             /* Offset: 0x10 (R/   32) Interrupt Mask Register */
  __I   uint32_t                       US_CSR;             /* Offset: 0x14 (R/   32) Channel Status Register */
  __I   uint32_t                       US_RHR;             /* Offset: 0x18 (R/   32) Receive Holding Register */
  __O   uint32_t                       US_THR;             /* Offset: 0x1C ( /W  32) Transmit Holding Register */
  __IO  uint32_t                       US_BRGR;            /* Offset: 0x20 (R/W  32) Baud Rate Generator Register */
  __IO  uint32_t                       US_RTOR;            /* Offset: 0x24 (R/W  32) Receiver Timeout Register */
  __IO  uint32_t                       US_TTGR;            /* Offset: 0x28 (R/W  32) Transmitter Timeguard Register */
  __I   uint8_t                        Reserved1[0x14];
  __IO  uint32_t                       US_FIDI;            /* Offset: 0x40 (R/W  32) FI DI Ratio Register */
  __I   uint32_t                       US_NER;             /* Offset: 0x44 (R/   32) Number of Errors Register */
  __I   uint8_t                        Reserved2[0x04];
  __IO  uint32_t                       US_IF;              /* Offset: 0x4C (R/W  32) IrDA Filter Register */
  __IO  uint32_t                       US_MAN;             /* Offset: 0x50 (R/W  32) Manchester Configuration Register */
  __IO  uint32_t                       US_LINMR;           /* Offset: 0x54 (R/W  32) LIN Mode Register */
  __IO  uint32_t                       US_LINIR;           /* Offset: 0x58 (R/W  32) LIN Identifier Register */
  __I   uint32_t                       US_LINBRR;          /* Offset: 0x5C (R/   32) LIN Baud Rate Register */
  __IO  uint32_t                       US_LONMR;           /* Offset: 0x60 (R/W  32) LON Mode Register */
  __IO  uint32_t                       US_LONPR;           /* Offset: 0x64 (R/W  32) LON Preamble Register */
  __IO  uint32_t                       US_LONDL;           /* Offset: 0x68 (R/W  32) LON Data Length Register */
  __IO  uint32_t                       US_LONL2HDR;        /* Offset: 0x6C (R/W  32) LON L2HDR Register */
  __I   uint32_t                       US_LONBL;           /* Offset: 0x70 (R/   32) LON Backlog Register */
  __IO  uint32_t                       US_LONB1TX;         /* Offset: 0x74 (R/W  32) LON Beta1 Tx Register */
  __IO  uint32_t                       US_LONB1RX;         /* Offset: 0x78 (R/W  32) LON Beta1 Rx Register */
  __IO  uint32_t                       US_LONPRIO;         /* Offset: 0x7C (R/W  32) LON Priority Register */
  __IO  uint32_t                       US_IDTTX;           /* Offset: 0x80 (R/W  32) LON IDT Tx Register */
  __IO  uint32_t                       US_IDTRX;           /* Offset: 0x84 (R/W  32) LON IDT Rx Register */
  __IO  uint32_t                       US_ICDIFF;          /* Offset: 0x88 (R/W  32) IC DIFF Register */
  __I   uint8_t                        Reserved3[0x58];
  __IO  uint32_t                       US_WPMR;            /* Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I   uint32_t                       US_WPSR;            /* Offset: 0xE8 (R/   32) Write Protection Status Register */
} usart_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CZMC70_USART_COMPONENT_H_ */
